[
	{
		"Title" : "1. Phil Taylor",
		"Pic" : "Phil_Taylor",
		"Des" : "English professional darts player Philip Douglas ‘Phil’ Taylor is widely considered the best darts player of all time and is the best among the top 10 greatest darts players of all time.

Sky Sports production manager Peter Judge nicknamed him ‘The Power’ during the World Matchplay in July 1995. Taylor achieved the titles of 209 professional tournaments till now, which includes 16 World Championships and 83 major international titles.

He became the finalist of the World Championship a record 14 consecutive times from 1994 to 2007 and achieved the World Championship title eight times consecutively from 1995 to 2002.

He is the first and only dart player to hit two nine-dart finishes in the 2010 Premier League Darts final. Taylor achieved the PDC Player of the Year award a record six times. He then also became the runner-up for the BBC Sports Personality of the Year award in 2010.",
		"IsVisible" : false
	},
	{
		"Title" : "2. Raymond van Barneveld",
		"Pic" : "Raymond_van_Barneveld",
		"Des" : "Dutch professional darts player Raymond van Barneveld is the most successful Dutch darts player in history and among the very best of the top 10 greatest darts players of all time.

He played a key role in the rising popularity of darts in the Netherlands and is currently playing in the Professional Darts Corporation. Barneveld was nicknamed Barney and is a four-time BDO World Champion and one-time PDC World Champion.

He is also a former title holder of the Las Vegas Desert Classic and a two-time UK Open Champion. Barneveld achieved the World Masters titles and the World Darts Trophy twice and is the current Premier League Darts champion.

He announced his shift from the BDO to the PDC after winning four World Championships while playing in the BDO for twenty years on 15 February 2006.",
		"IsVisible" : false
	},
	{
		"Title" : "3. Eric Bristow",
		"Pic" : "Eric_Bristow",
		"Des" : "Former professional English darts player Eric Bristow achieved the World No. 1 rank in three separate spells in his active career from 1980 to 81, 1983 to 85, and again in 1990. His fans also call him ‘The Crafty Cockney.’ And now, he deserves the third position in our list of the top 10 greatest darts players of all time for his accomplishments in the field of Darts.

Bristow achieved World Championship titles and World Masters titles five times each and played a key role in turning darts into a worldwide spectator sport.

He is one of the top 16 players to join the Professional Darts Corporation in 1993. He is currently working as a commentator of Sky Sports’ darts coverage after he retired from the professional field in 2007.

Bristow received the MBE in 1989 for his glorious contribution to the field of Darts. Besides his sporting career, he also participated in the reality show “I’m a Celebrity…Get Me Out of Here!” in 2012.",
		"IsVisible" : false
	},
	{
		"Title" : "4. Michael van Gerwen",
		"Pic" : "Michael_van_Gerwen",
		"Des" : "Young Dutch professional darts player Michael van Gerwen is the current world number one Dart player and is the best youngster in the list of our top 10 greatest darts players of all time. He started playing Darts at the age of 13 and quickly earned praises as a darts prodigy.

Gerwen threw a televised nine-dart finish and achieved the World Masters titles within four years of his debut in this sport; both of them are still a world record.

He had shown a massive progression of his skills in his early days as he climbed up from world number 38 at the start of 2012 to number 4 at the beginning of 2013.

Gerwen became the youngest dart player to win the PDC World Championship at the age of 24 in 2014. He recently achieved his first UK Open title while defeating Peter Wright in the 2015 final.",
		"IsVisible" : false
	},
	{
		"Title" : "5. James Wade",
		"Pic" : "James_Wade",
		"Des" : "English professional darts player James Martin Wade became the youngest dart player to win a major PDC title at the age of just 24 at the World Matchplay in 2007. Michael van Gerwen later surpassed the record at the 2012 World Grand Prix.

James Wade is currently playing in the Professional Darts Corporation and is one of the most prominent dart players in the list of top 10 greatest darts players of all time.

He started his career in the British Darts Organization and later moved to the Professional Dart Corporation in 2004. James also holds the record for being the first player to hit three tournament nine-dart finishes in a single calendar, a feat that he achieved in 2006.

He won the World Matchplay and the World Grand Prix in 2007 and again achieved the Grand Prix title in 2010. He is the second most successful player in PDC with his eight major tournament wins.",
		"IsVisible" : false
	},
	{
		"Title" : "6. Gary Anderson",
		"Pic" : "Gary_Anderson",
		"Des" : "Scottish professional darts player Gary Anderson, nicknamed the Flying Scotsman, is a former BDO and WDF world number one. He is currently playing in the Professional Darts Corporation and is one of the most promising dart players in our list of top 10 greatest darts players of all time.

Anderson recently became the reigning PDC World Champion while defeating Phil Taylor in the 2015 final by a score of 7-6. He won the World Darts Trophy, the International Darts League title, and the Zuiderduin Masters in 2007.

He also achieved the Premier League title in 2011 and won the Players Championship Finals in 2014.

Anderson is a seven-time major winner in his career with the BDO and PDC. Wayne Mardle, while watching Anderson hitting his doubles, once stated, “Nobody can live with him when he does that. Whether you’re world champion or world No 1, you will get beaten by Gary Anderson.”",
		"IsVisible" : false
	},
	{
		"Title" : "7. Adrian Lewis",
		"Pic" : "Adrian_Lewis",
		"Des" : "English professional darts player Adrian Lewis is a two-time PDC World Darts Champion and is one of the very best dart players in our list of top 10 greatest darts players of all time.

He was nicknamed “Jackpot” after he won a $72,000 jackpot whilst competing at the 2005 Las Vegas Desert Classic. Although he was unable to claim the money as he was underage at the time according to the US gaming laws despite being eligible to participate in the UK. Lewis and legendary world champion Phil Taylor practiced together in their home city Stoke-on-Trent till 2007. He made his television debut at the age of just 19 at the UK Open in 2004.

He reached the quarter-finals in his PDC World Championship debut in 2006. Lewis won a total of £1,900,000 prize money during his 12-year career and is currently ranked fourth on the PDC Order of Merit.",
		"IsVisible" : false
	},
	{
		"Title" : "8. John Lowe",
		"Pic" : "John_Lowe",
		"Des" : "Former English professional darts player John Lowe was one of the most prominent dart forces during the 1970s and 1980s and is among the very best pre-modern dart players in our list of top 10 greatest darts players of all time.

He is widely regarded as one of the most skilled darts players ever and earned massive popularity throughout the United Kingdom in his heydays.

He is one of the only six players to win the World Championship three times, which he achieved in 1979, 1987, and 1993. Lowe is also the first player ever to earn the World Championship titles in three separate decades.

He is noted for being the first player ever to hit a televised nine-dart finish which he did in 1984. Lowe, besides his active sports career, also served his duty as secretary of the World Professional Dart Players Association.",
		"IsVisible" : false
	},
	{
		"Title" : "9. Martin Adams",
		"Pic" : "Martin_Adams",
		"Des" : "English professional darts player Martin Adams is a three-time World Masters championship winner and also a three-time BDO World Championship titleholder. He holds the record for having the longest role as the captain of the England dart team from 1994 to 2013.

He is one of the legendary dart superstars in our list of top 10 greatest darts players of all time. Adams won the WDF World Cup singles twice in his active career.

He started his darts career in pubs and currently plays for Rigby’s in Market Deeping, Lincolnshire, besides representing Cambridgeshire at the county darts level. Adams won the Dutch Open title for the first time in February 2010 while defeating Scott Waites with 3–1.

He is also the second player in dart history besides Bob Anderson to win three consecutive World Masters titles. Adams defeated Phil Taylor and won the non-televised Scania Open in 1999.",
		"IsVisible" : false
	},
	{
		"Title" : "10. John Part",
		"Pic" : "John_Part",
		"Des" : "Canadian professional darts player John Part was nicknamed Darth Maple and is one of the greatest players of dart history besides being an inductee in our list of top 10 greatest darts players of all time.

He won the PDC World Championship twice in 2003 and 2008 and became the winner of the BDO World Championship in 1994. He won the 2006 Las Vegas Desert Classic title and statistically became North America’s greatest ever dart player.

John won the Canadian National Championships five times and became the Canadian Open winner three times till now. He also achieved the Ireland Open Autumn Classic and Spring Classic in 2002.

Besides his active sporting career, he worked as a commentator for the BBC on the BDO World Championships from 1995 to 2007. He recently started commentating for Sky Sports at the 2013 World Matchplay and became a leading member of the Sky Sports team.",
		"IsVisible" : false
	},
]